thanhnt2410/IOTChallenge2024_Smart_Parking_Car/Code EFR32XG24/Z3Gateway/autogen/sl_cli_command_table.c
/***************************************************************************//**
 * @file sl_cli_command_table.c
 * @brief Declarations of relevant command structs for cli framework.
 * @version x.y.z
 *******************************************************************************
 * # License
 * <b>Copyright 2018 Silicon Laboratories Inc. www.silabs.com</b>
 *******************************************************************************
 *
 * SPDX-License-Identifier: Zlib
 *
 * The licensor of this software is Silicon Laboratories Inc.
 *
 * This software is provided 'as-is', without any express or implied
 * warranty. In no event will the authors be held liable for any damages
 * arising from the use of this software.
 *
 * Permission is granted to anyone to use this software for any purpose,
 * including commercial applications, and to alter it and redistribute it
 * freely, subject to the following restrictions:
 *
 * 1. The origin of this software must not be misrepresented; you must not
 *    claim that you wrote the original software. If you use this software
 *    in a product, an acknowledgment in the product documentation would be
 *    appreciated but is not required.
 * 2. Altered source versions must be plainly marked as such, and must not be
 *    misrepresented as being the original software.
 * 3. This notice may not be removed or altered from any source distribution.
 *
 ******************************************************************************/

#include <stdlib.h>

#include "sl_cli_config.h"
#include "sl_cli_command.h"
#include "sl_cli_arguments.h"

#ifdef __cplusplus
extern "C" {
#endif

/*******************************************************************************
 *****************************   TEMPLATED FILE   ******************************
 ******************************************************************************/

/*******************************************************************************
 * Example syntax (.slcc or .slcp) for populating this file:
 *
 *   template_contribution:
 *     - name: cli_command          # Register a command
 *       value:
 *         name: status             # Name of command
 *         handler: status_command  # Function to be called. Must be defined
 *         help: "Prints status"    # Optional help description
 *         shortcuts:               # Optional shorcut list
 *           - name: st
 *         argument:                # Argument list, if apliccable
 *           - type: uint8          # Variable type
 *             help: "Channel"      # Optional description
 *           - type: string
 *             help: "Text"
 *     - name: cli_group            # Register a group
 *       value:
 *         name: shell              # Group name
 *         help: "Shell commands"   # Optional help description
 *         shortcuts:               # Optional shorcuts
 *           - name: sh
 *     - name: cli_command
 *       value:
 *         name: repeat
 *         handler: repeat_cmd
 *         help: "Repeat commands"
 *         shortcuts:
 *           - name: r
 *           - name: rep
 *         group: shell            # Associate command with group
 *         argument:
 *           - type: string
 *             help: "Text"
 *           - type: additional
 *             help: "More text"
 *
 * For subgroups, an optional unique id can be used to allow a particular name to
 * be used more than once. In the following case, from the command line the
 * following commands are available:
 *
 * >  root_1 shell status
 * >  root_2 shell status
 *
 *     - name: cli_group            # Register a group
 *       value:
 *         name: root_1             # Group name
 *
 *     - name: cli_group            # Register a group
 *       value:
 *         name: root_2             # Group name
 *
 *    - name: cli_group             # Register a group
 *       value:
 *         name: shell              # Group name
 *         id: shell_root_1         # Optional unique id for group
 *         group: root_1            # Add group to root_1 group
 *
 *    - name: cli_group             # Register a group
 *       value:
 *         name: shell              # Group name
 *         id: shell_root_2         # Optional unique id for group
 *         group: root_2            # Add group to root_1 group
 *
 *    - name: cli_command           # Register a command
 *       value:
 *         name: status
 *         handler: status_1
 *         group: shell_root_1      # id of subgroup
 *
 *    - name: cli_command           # Register a command
 *       value:
 *         name: status
 *         handler: status_2
 *         group: shell_root_2      # id of subgroup
 *
 ******************************************************************************/

// Provide function declarations
void emberAfPluginAddressTableAddCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginAddressTableSetCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginAddressTableRemoveCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginAddressTableLookupCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginAddressTablePrintCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginConcentratorStatus(sl_cli_command_arg_t *arguments);
void emberAfPluginConcentratorStartDiscoveryCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginConcentratorStopDiscoveryCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginConcentratorAggregationCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginConcentratorPrintSourceRouteTable(sl_cli_command_arg_t *arguments);
void emberAfPluginConcentratorSetRouterBehaviorCommand(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_cli_info_command(sl_cli_command_arg_t *arguments);
void printAllLibraryStatus(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_cli_bsend_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_send_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_zcl_read_cli_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_zcl_write_cli_command(sl_cli_command_arg_t *arguments);
void resetCommand(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_cli_raw_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_send_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_cli_send_using_multicast_binding_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_cli_timesync_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_config_cca_mode_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_cli_version_command(sl_cli_command_arg_t *arguments);
void endpointPrint(sl_cli_command_arg_t *arguments);
void enableDisableEndpoint(sl_cli_command_arg_t *arguments);
void enableDisableEndpoint(sl_cli_command_arg_t *arguments);
void printEvents(sl_cli_command_arg_t *arguments);
void getSetMfgToken(sl_cli_command_arg_t *arguments);
void getSetMfgToken(sl_cli_command_arg_t *arguments);
void emberAfPluginCountersPrintCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginCounterPrintCounterTypeCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginCountersSimplePrintCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginCountersClear(sl_cli_command_arg_t *arguments);
void emberAfPluginCountersPrintThresholdsCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginCountersSetThresholdCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginCountersResetThresholds(sl_cli_command_arg_t *arguments);
void emberAfPluginCountersSendRequestCommand(sl_cli_command_arg_t *arguments);
void sli_zigbee_debug_print_enable_stack_type_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_debug_print_enable_core_type_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_debug_print_enable_app_type_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_debug_print_enable_zcl_type_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_debug_print_enable_legacy_af_debug_type_command(sl_cli_command_arg_t *arguments);
void emberAfPluginEzModeCommissioningClientCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginEzModeCommissioningServerCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginGatewaySupportTimeSyncLocal(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_ias_zone_client_print_servers_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_ias_zone_client_clear_all_servers_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_identify_cli_print(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_mfglib_start_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_mfglib_stop_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_mfglib_tone_start_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_mfglib_tone_stop_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_mfglib_status_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_mfglib_set_channel_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_mfglib_set_power_and_mode_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_mfglib_stream_start_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_mfglib_stream_stop_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_mfglib_send_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_mfglib_send_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_mfglib_send_message_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_mfglib_sleep_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_mfglib_program_eui_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_mfglib_enable_mfglib(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_mfglib_set_options(sl_cli_command_arg_t *arguments);
void emberAfPluginNetworkCreatorStartCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginNetworkCreatorStop(sl_cli_command_arg_t *arguments);
void emberAfPluginNetworkCreatorFormCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginNetworkCreatorChannelMaskCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginNetworkCreatorChannelMaskCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginNetworkCreatorChannelMaskCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginNetworkCreatorStatusCommand(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_network_creator_security_set_joining_link_key_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_network_creator_security_clear_joining_link_key_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_network_creator_security_open_or_close_network_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_network_creator_security_open_or_close_network_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_network_creator_security_open_network_with_key_command(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_network_creator_security_configure_distributed_key(sl_cli_command_arg_t *arguments);
void emberAfPluginNetworkSteeringStatusCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginNetworkSteeringStartCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginNetworkSteeringStopCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginNetworkSteeringSetPreconfiguredKeyCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginNetworkSteeringChannelSetCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginNetworkSteeringChannelAddOrSubtractCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginNetworkSteeringChannelAddOrSubtractCommand(sl_cli_command_arg_t *arguments);
void otaImageNotifyCommand(sl_cli_command_arg_t *arguments);
void otaSendUpgradeCommand(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_ota_server_policy_print(sl_cli_command_arg_t *arguments);
void setPolicy(sl_cli_command_arg_t *arguments);
void setPolicy(sl_cli_command_arg_t *arguments);
void setPolicy(sl_cli_command_arg_t *arguments);
void setPolicy(sl_cli_command_arg_t *arguments);
void setPolicy(sl_cli_command_arg_t *arguments);
void setPolicy(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_ota_print_all_images(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_ota_image_delete(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_ota_reload_storage_device(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_ota_storage_info_print(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_ota_storage_data_print(sl_cli_command_arg_t *arguments);
void mode(sl_cli_command_arg_t *arguments);
void timeout(sl_cli_command_arg_t *arguments);
void respond(sl_cli_command_arg_t *arguments);
void print(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_reporting_cli_print(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_reporting_cli_clear(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_reporting_cli_remove(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_reporting_cli_add(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_reporting_cli_clear_last_report_time(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_reporting_cli_test_timing(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_simple_metering_client_cli_sch_snapshot(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_simple_metering_client_cli_start_sampling(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_simple_metering_client_cli_get_sampled_data(sl_cli_command_arg_t *arguments);
void sli_zigbee_af_simple_metering_client_cli_local_change_supply(sl_cli_command_arg_t *arguments);
void printInfo(sl_cli_command_arg_t *arguments);
void printChildTable(sl_cli_command_arg_t *arguments);
void printNeighborTable(sl_cli_command_arg_t *arguments);
void printRouteTable(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessStatusCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessSetApsSecurityForClusterCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessSetApsSecurityForClusterCommand(sl_cli_command_arg_t *arguments);
void setOptionsCommand(sl_cli_command_arg_t *arguments);
void setDestinationCommand(sl_cli_command_arg_t *arguments);
void startTestCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessSetRegistrationCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessSetRegistrationCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessKeyEstablishmentSetModeCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessKeyEstablishmentSetModeCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessKeyEstablishmentSetModeCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessKeyEstablishmentSetModeCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessKeyEstablishmentSetModeCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessKeyEstablishmentSetModeCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessKeyEstablishmentSetModeCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessKeyEstablishmentSetModeCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessKeyEstablishmentSetModeCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessCertMangleCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessCertMangleCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessCertMangleCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessCertMangleCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessCertMangleCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessKeyEstablishmentSelectSuiteCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessKeyEstablishmentSetAvailableSuiteCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessKeyEstablishmentKeyMangleCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessPriceSendNewFieldsCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessPriceSendNewFieldsCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessTcKeepaliveSendCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessTcKeepaliveStartStopCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessTcKeepaliveStartStopCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessOtaImageMangleCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessConcentratorStartStopCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessConcentratorStartStopCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessKeyUpdateCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessKeyUpdateCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessKeyUpdateCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessLimitBeaconsOnOffCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessLimitBeaconsOnOffCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessEnableDisableEndpointCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessEnableDisableEndpointCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessEndpointStatusCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessClusterEndpointIndexCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessRadioOnOffCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessRadioOnOffCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessSetRadioPower(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessAddChildCommand(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessSetNodeDescriptorComplianceRevision(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessSetMaxChildren(sl_cli_command_arg_t *arguments);
void emberAfPluginTestHarnessSetNeighborTableSize(sl_cli_command_arg_t *arguments);
void sl_zigbee_suppress_cluster(sl_cli_command_arg_t *arguments);
void sl_zigbee_suppress_command(sl_cli_command_arg_t *arguments);
void sl_zigbee_print_suppression_table(sl_cli_command_arg_t *arguments);
void emberAfPluginSetTCLinkKeyUpdateTimerCommand(sl_cli_command_arg_t *arguments);
void networkFormCommand(sl_cli_command_arg_t *arguments);
void networkJoinCommand(sl_cli_command_arg_t *arguments);
void networkPermitJoinCommand(sl_cli_command_arg_t *arguments);
void networkLeaveCommand(sl_cli_command_arg_t *arguments);
void networkRejoinCommand(sl_cli_command_arg_t *arguments);
void networkRejoinDiffDeviceTypeCommand(sl_cli_command_arg_t *arguments);
void networkExtendedPanIdCommand(sl_cli_command_arg_t *arguments);
void networkCheckPjoinCommand(sl_cli_command_arg_t *arguments);
void networkPermitJoinCommand(sl_cli_command_arg_t *arguments);
void findJoinableNetworkCommand(sl_cli_command_arg_t *arguments);
void findUnusedPanIdCommand(sl_cli_command_arg_t *arguments);
void networkChangeChannelCommand(sl_cli_command_arg_t *arguments);
void networkSetCommand(sl_cli_command_arg_t *arguments);
void networkInitCommand(sl_cli_command_arg_t *arguments);
void networkIdCommand(sl_cli_command_arg_t *arguments);
void changeKeepAliveModeCommand(sl_cli_command_arg_t *arguments);
void networkChangeChildTimeoutOptionMaskCommand(sl_cli_command_arg_t *arguments);
void networkMultiPhyStartCommand(sl_cli_command_arg_t *arguments);
void networkMultiPhyStopCommand(sl_cli_command_arg_t *arguments);
void keysPrintCommand(sl_cli_command_arg_t *arguments);
void keysDeleteCommand(sl_cli_command_arg_t *arguments);
void keysClearCommand(sl_cli_command_arg_t *arguments);
void optionBindingTablePrintCommand(sl_cli_command_arg_t *arguments);
void optionBindingTableClearCommand(sl_cli_command_arg_t *arguments);
void optionBindingTableSetCommand(sl_cli_command_arg_t *arguments);
void optionPrintRxCommand(sl_cli_command_arg_t *arguments);
void optionPrintRxCommand(sl_cli_command_arg_t *arguments);
void optionRegisterCommand(sl_cli_command_arg_t *arguments);
void optionDiscoveryTargetCommand(sl_cli_command_arg_t *arguments);
void optionDiscoverCommand(sl_cli_command_arg_t *arguments);
void optionApsRetryCommand(sl_cli_command_arg_t *arguments);
void optionApsRetryCommand(sl_cli_command_arg_t *arguments);
void optionApsRetryCommand(sl_cli_command_arg_t *arguments);
void optionApsSecurityCommand(sl_cli_command_arg_t *arguments);
void optionApsSecurityCommand(sl_cli_command_arg_t *arguments);
void optionSecurityAllowTrustCenterRejoinUsingWellKnownKey(sl_cli_command_arg_t *arguments);
void optionSecurityAllowTrustCenterRejoinUsingWellKnownKeyTimeout(sl_cli_command_arg_t *arguments);
void optionSecuritySetKeyRequestPolicy(sl_cli_command_arg_t *arguments);
void changeKeyCommand(sl_cli_command_arg_t *arguments);
void changeKeyCommand(sl_cli_command_arg_t *arguments);
void optionLinkCommand(sl_cli_command_arg_t *arguments);
void optionInstallCodeCommand(sl_cli_command_arg_t *arguments);
void zdoRouteRequestCommand(sl_cli_command_arg_t *arguments);
void zdoPowerDescriptorRequestCommand(sl_cli_command_arg_t *arguments);
void zdoMgmtLqiCommand(sl_cli_command_arg_t *arguments);
void zdoMgmtBindCommand(sl_cli_command_arg_t *arguments);
void zdoLeaveRequestCommand(sl_cli_command_arg_t *arguments);
void zdoUnbindGroupCommand(sl_cli_command_arg_t *arguments);
void zdoUnbindUnicastCommand(sl_cli_command_arg_t *arguments);
void zdoActiveEpCommand(sl_cli_command_arg_t *arguments);
void zdoBindCommand(sl_cli_command_arg_t *arguments);
void zdoNodeCommand(sl_cli_command_arg_t *arguments);
void zdoMatchCommand(sl_cli_command_arg_t *arguments);
void zdoSimpleCommand(sl_cli_command_arg_t *arguments);
void zdoIeeeAddressRequestCommand(sl_cli_command_arg_t *arguments);
void zdoNwkAddressRequestCommand(sl_cli_command_arg_t *arguments);
void zdoNetworkUpdateScanCommand(sl_cli_command_arg_t *arguments);
void zdoNetworkUpdateSetCommand(sl_cli_command_arg_t *arguments);
void zdoNetworkUpdateScanCommand(sl_cli_command_arg_t *arguments);
void zdoNetworkUpdateChannelCommand(sl_cli_command_arg_t *arguments);
void zdoNetworkUpdateChannelCommand(sl_cli_command_arg_t *arguments);
void zdoAddClusterCommand(sl_cli_command_arg_t *arguments);
void zdoClearClusterCommand(sl_cli_command_arg_t *arguments);
void zdoAddClusterCommand(sl_cli_command_arg_t *arguments);
void zdoClearClusterCommand(sl_cli_command_arg_t *arguments);
void emberAfPrintAttributeTable(sl_cli_command_arg_t *arguments);
void printTimeCommand(sl_cli_command_arg_t *arguments);
void mfgappTokenDump(sl_cli_command_arg_t *arguments);
void changeNwkKeyCommand(sl_cli_command_arg_t *arguments);
void printNextKeyCommand(sl_cli_command_arg_t *arguments);
void versionCommand(sl_cli_command_arg_t *arguments);
void setTxPowerCommand(sl_cli_command_arg_t *arguments);

// Command structs. Names are in the format : cli_cmd_{command group name}_{command name}
// In order to support hyphen in command and group name, every occurence of it while
// building struct names will be replaced by "_hyphen_"
static const sl_cli_command_info_t cli_cmd_address_hyphen_table_add = \
  SL_CLI_COMMAND(emberAfPluginAddressTableAddCommand,
                 "",
                  "Entry to be added" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_HEX, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_address_hyphen_table_set = \
  SL_CLI_COMMAND(emberAfPluginAddressTableSetCommand,
                 "Sets an entry in the address table according to the arguments specified.",
                  "" SL_CLI_UNIT_SEPARATOR "" SL_CLI_UNIT_SEPARATOR "" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_HEX, SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_address_hyphen_table_remove = \
  SL_CLI_COMMAND(emberAfPluginAddressTableRemoveCommand,
                 "Removes an entry from the address table.",
                  "Entry to be removed" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_HEX, SL_CLI_ARG_END, });

