thanhnt2410/IOTChallenge2024_Smart_Parking_Car/Code EFR32XG24/Z3Gateway/autogen/sl_cli_command_table.c
static const sl_cli_command_info_t cli_cmd_tone_start = \
  SL_CLI_COMMAND(sli_zigbee_af_mfglib_tone_start_command,
                 "Starts a tone test.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_tone_stop = \
  SL_CLI_COMMAND(sli_zigbee_af_mfglib_tone_stop_command,
                 "Stops the tone test.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_mfglib_status = \
  SL_CLI_COMMAND(sli_zigbee_af_mfglib_status_command,
                 "Prints the current status of the manufacturing library.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_mfglib_set_hyphen_channel = \
  SL_CLI_COMMAND(sli_zigbee_af_mfglib_set_channel_command,
                 "Sets the channel used by the manufacturing library for testing.",
                  "The 802.15.4 channel number." SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_mfglib_set_hyphen_power = \
  SL_CLI_COMMAND(sli_zigbee_af_mfglib_set_power_and_mode_command,
                 "Set the power level and mode for the manufacturing test.",
                  "The power level" SL_CLI_UNIT_SEPARATOR "The power mode" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_INT8, SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_stream_start = \
  SL_CLI_COMMAND(sli_zigbee_af_mfglib_stream_start_command,
                 "Start the stream test.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_stream_stop = \
  SL_CLI_COMMAND(sli_zigbee_af_mfglib_stream_stop_command,
                 "Stop the stream test.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_send_random = \
  SL_CLI_COMMAND(sli_zigbee_af_mfglib_send_command,
                 "Send a series of test packets with random data..",
                  "The number of packets to send." SL_CLI_UNIT_SEPARATOR "The length of the packet to send." SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_send_test = \
  SL_CLI_COMMAND(sli_zigbee_af_mfglib_send_command,
                 "Send a series of test packets with fixed data.",
                  "The number of packets to send." SL_CLI_UNIT_SEPARATOR "The length of the packet to send." SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_send_message = \
  SL_CLI_COMMAND(sli_zigbee_af_mfglib_send_message_command,
                 "Send a test message with the specified data in it.",
                  "The hex data to send, up to 16 bytes." SL_CLI_UNIT_SEPARATOR "The number of packets to send." SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_HEX, SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_mfglib_sleep = \
  SL_CLI_COMMAND(sli_zigbee_af_mfglib_sleep_command,
                 "Sleep.",
                  "Sleep duration (mS)." SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_mfglib_programEui = \
  SL_CLI_COMMAND(sli_zigbee_af_mfglib_program_eui_command,
                 "Program EUI.",
                  "IEEE address to program." SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_HEX, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_mfglib_mfgenable = \
  SL_CLI_COMMAND(sli_zigbee_af_mfglib_enable_mfglib,
                 "Enable mfglib.",
                  "1 = enable, 0 = disable." SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_mfglib_set_hyphen_options = \
  SL_CLI_COMMAND(sli_zigbee_af_mfglib_set_options,
                 "Sets options in the manufacturing library for testing.",
                  "The options bitmask (0 = normal transmit, 1 = CSMA transmit)." SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_network_hyphen_creator_start = \
  SL_CLI_COMMAND(emberAfPluginNetworkCreatorStartCommand,
                 "Starts the network formation process.",
                  "Whether or not to form a centralized network. If this value is false, the device will attempt to join a distributed network." SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_INT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_network_hyphen_creator_stop = \
  SL_CLI_COMMAND(emberAfPluginNetworkCreatorStop,
                 "Stops the network formation process.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_network_hyphen_creator_form = \
  SL_CLI_COMMAND(emberAfPluginNetworkCreatorFormCommand,
                 "Forms a network with specified parameters.",
                  "Whether or not to form a centralized network. If this value is false, the device will attempt to join a distributed network." SL_CLI_UNIT_SEPARATOR "PanID of the network to be formed" SL_CLI_UNIT_SEPARATOR "Tx power of the network to be formed" SL_CLI_UNIT_SEPARATOR "Channel of the network to be formed" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_INT8, SL_CLI_ARG_UINT16, SL_CLI_ARG_INT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_mask_add = \
  SL_CLI_COMMAND(emberAfPluginNetworkCreatorChannelMaskCommand,
                 "Adds a channel to the channel mask of choice.",
                  "The mask to which to add the channel. 1 chooses the primary channel mask, any other argument chooses the secondary channel mask." SL_CLI_UNIT_SEPARATOR "The channel to add to the channel mask" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

