thanhnt2410/IOTChallenge2024_Smart_Parking_Car/Code EFR32XG24/Z3Gateway/autogen/sl_cli_command_table.c
static const sl_cli_command_info_t cli_cmd_ota_hyphen_server_notify = \
  SL_CLI_COMMAND(otaImageNotifyCommand,
                 "Sends an OTA Image Notify message to the specified destination indicating a new version of an image is available for download.",
                  "The node ID (can be a broadcast address) to which this OTA Notify message should be sent" SL_CLI_UNIT_SEPARATOR "Target endpoint for the OTA Notify message (only meaningful for non-broadcast target destination)" SL_CLI_UNIT_SEPARATOR "Specifies which parameters to include in the OTA Notify cluster command payload (0 = jitter value only; 1 = jitter and manufacturer id; 2 = jitter, mfr id, and device id; 3 = jitter, mfr id, device id, and firmware version)" SL_CLI_UNIT_SEPARATOR "Corresponds to QueryJitter parameter in the OTA Upgrade cluster specification. Indicates whether the client receiving Image Notify Command should send in Query Next Image Request command or not." SL_CLI_UNIT_SEPARATOR "Manufacturer ID for the image being advertised (should match the mfr ID in the OTA files header)" SL_CLI_UNIT_SEPARATOR "Image type ID for the image being advertised (should match the image type ID from the OTA files header)" SL_CLI_UNIT_SEPARATOR "Firmware version of the image being advertised (should match the version from the OTA files header)" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_ota_hyphen_server_upgrade = \
  SL_CLI_COMMAND(otaSendUpgradeCommand,
                 "Instructs a device to upgrade now.",
                  "Short destination to send message" SL_CLI_UNIT_SEPARATOR "Endpoint destination to send message" SL_CLI_UNIT_SEPARATOR "Manufacturer ID for the image (0xFFFF for wildcard)" SL_CLI_UNIT_SEPARATOR "Image type for the image (0xFFFF for wildcard)" SL_CLI_UNIT_SEPARATOR "File version for the image (0xFFFFFFFF for wildcard)" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_policy_print = \
  SL_CLI_COMMAND(sli_zigbee_af_ota_server_policy_print,
                 "Prints the polices used by the OTA Server Policy component.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_policy_query = \
  SL_CLI_COMMAND(setPolicy,
                 "Sets the policy used by the OTA Server Policy component when it receives a query request from the client.",
                  "0 Upgrade if server has newer (default), 1 Downgrade if server has older, 2       Reinstall if server has same, 3 No next version (no next image is available for download)" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_policy_upgrade = \
  SL_CLI_COMMAND(setPolicy,
                 "Sets the policy used by the OTA Server Policy component when it receives an upgrade end request.",
                  "0 Upgrade Now (default), 1 Upgrade in 2       minutes, 2 Ask me later to upgrade, 3 Abort Upgrade (send default response)" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_policy_page_hyphen_req_hyphen_miss = \
  SL_CLI_COMMAND(setPolicy,
                 "Sets the modulus number of blocks not to respond to. This is used in testing to simulate a device that fails to receive certain blocks from an Image Page Request message.",
                  "The block modulus number to skip sending when responding to an Image Page Request. E.g. if 2, every other block will not be sent. 0 turns the feature off." SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_policy_page_hyphen_req_hyphen_sup = \
  SL_CLI_COMMAND(setPolicy,
                 "Sets whether the Page Request feature is supported or not.",
                  "1 if Page Request is supported, 0 if unsupported" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_policy_block_hyphen_request = \
  SL_CLI_COMMAND(setPolicy,
                 "Sets the policy used by the ota-server Policy component when it receives an image block request.",
                  "0 Send block (default), 1 Delay download once for 2 minutes, 2 Always abort download after first block" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_policy_image_hyphen_req_hyphen_min_hyphen_period = \
  SL_CLI_COMMAND(setPolicy,
                 "Sets the Minimum Block Period.",
                  "The minimum block period in milliseconds" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_ota_hyphen_storage_hyphen_common_printImages = \
  SL_CLI_COMMAND(sli_zigbee_af_ota_print_all_images,
                 "Prints the images.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_ota_hyphen_storage_hyphen_common_delete = \
  SL_CLI_COMMAND(sli_zigbee_af_ota_image_delete,
                 "Deletes the image at the specified index.",
                  "The index at which to begin deleting the image" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_ota_hyphen_storage_hyphen_common_reload = \
  SL_CLI_COMMAND(sli_zigbee_af_ota_reload_storage_device,
                 "Reload the storage device.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_ota_hyphen_storage_hyphen_common_storage_hyphen_info = \
  SL_CLI_COMMAND(sli_zigbee_af_ota_storage_info_print,
                 "Prints information about the storage device.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_ota_hyphen_storage_hyphen_common_data_hyphen_print = \
  SL_CLI_COMMAND(sli_zigbee_af_ota_storage_data_print,
                 "Prints arbitrary bytes of the OTA image on disk.",
                  "The index of the image to print its data" SL_CLI_UNIT_SEPARATOR "The offset into the OTA image that will be printed" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_poll_hyphen_control_hyphen_client_mode = \
  SL_CLI_COMMAND(mode,
                 "Sets the fast polling mode.",
                  "The fast polling mode" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_INT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_poll_hyphen_control_hyphen_client_timeout = \
  SL_CLI_COMMAND(timeout,
                 "Sets the fast polling timeout.",
                  "The fast polling timeout" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_poll_hyphen_control_hyphen_client_respond = \
  SL_CLI_COMMAND(respond,
                 "Sets the response mode.",
                  "The response mode" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_INT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_poll_hyphen_control_hyphen_client_print = \
  SL_CLI_COMMAND(print,
                 "Prints the fast polling mode and timeout.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_reporting_print = \
  SL_CLI_COMMAND(sli_zigbee_af_reporting_cli_print,
                 "Prints the report table.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_reporting_clear = \
  SL_CLI_COMMAND(sli_zigbee_af_reporting_cli_clear,
                 "Clears all entries from the report table.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_reporting_remove = \
  SL_CLI_COMMAND(sli_zigbee_af_reporting_cli_remove,
                 "Removes an entry from the report table.",
                  "The index of the report to be removed" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_reporting_add = \
  SL_CLI_COMMAND(sli_zigbee_af_reporting_cli_add,
                 "Adds a new entry to the report table.",
                  "The local endpoint from which the attribute is reported" SL_CLI_UNIT_SEPARATOR "The cluster where the attribute is located" SL_CLI_UNIT_SEPARATOR "The ID of the attribute being reported" SL_CLI_UNIT_SEPARATOR "0 for client-side attributes or 1 for server-side attributes" SL_CLI_UNIT_SEPARATOR "The minimum reporting interval, measured in seconds." SL_CLI_UNIT_SEPARATOR "The maximum reporting interval, measured in seconds." SL_CLI_UNIT_SEPARATOR "The minimum change to the attribute that will result in a report being sent." SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_reporting_clear_hyphen_last_hyphen_report_hyphen_time = \
  SL_CLI_COMMAND(sli_zigbee_af_reporting_cli_clear_last_report_time,
                 "Clears the last report time of attributes.",
                  "",
                 {SL_CLI_ARG_END, });

