thanhnt2410/IOTChallenge2024_Smart_Parking_Car/Code EFR32XG24/Z3Gateway/autogen/sl_cli_command_table.c
static const sl_cli_command_info_t cli_cmd_reporting_test_hyphen_timing = \
  SL_CLI_COMMAND(sli_zigbee_af_reporting_cli_test_timing,
                 "FOR TESTING PURPOSES - gather timing metrics for reporting table operations.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_simple_hyphen_metering_hyphen_client_sch_hyphen_snapshot = \
  SL_CLI_COMMAND(sli_zigbee_af_simple_metering_client_cli_sch_snapshot,
                 "Schedules a snapshot.",
                  "The network address of the server to which the request will be sent" SL_CLI_UNIT_SEPARATOR "The local endpoint from which the request will be sent" SL_CLI_UNIT_SEPARATOR "The remote endpoint to which the request will be sent" SL_CLI_UNIT_SEPARATOR "The issuerId" SL_CLI_UNIT_SEPARATOR "The commandIndex" SL_CLI_UNIT_SEPARATOR "The total number of commands" SL_CLI_UNIT_SEPARATOR "The snapshot schedule Id" SL_CLI_UNIT_SEPARATOR "The start time" SL_CLI_UNIT_SEPARATOR "The snapshot schedule. 3 bytes" SL_CLI_UNIT_SEPARATOR "The snapshot Type" SL_CLI_UNIT_SEPARATOR "The snapshot schedule cause" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT32, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT32, SL_CLI_ARG_UINT32, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_simple_hyphen_metering_hyphen_client_start_hyphen_sampling = \
  SL_CLI_COMMAND(sli_zigbee_af_simple_metering_client_cli_start_sampling,
                 "Sends a start sampling command to a metering server.",
                  "The network address of the server to which the request will be sent" SL_CLI_UNIT_SEPARATOR "The local endpoint from which the request will be sent" SL_CLI_UNIT_SEPARATOR "The remote endpoint to which the request will be sent" SL_CLI_UNIT_SEPARATOR "The issuerId" SL_CLI_UNIT_SEPARATOR "The time to start sampling" SL_CLI_UNIT_SEPARATOR "An 8-bit enumeration that identifies the type of data being sampled" SL_CLI_UNIT_SEPARATOR "An unsigned 16-bit field representing the interval or time in seconds between samples" SL_CLI_UNIT_SEPARATOR "A 16-bit unsigned integer that represents the number of samples to be taken" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT32, SL_CLI_ARG_UINT32, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_simple_hyphen_metering_hyphen_client_get_hyphen_sampled_hyphen_data = \
  SL_CLI_COMMAND(sli_zigbee_af_simple_metering_client_cli_get_sampled_data,
                 "Sends a start sampling command to a metering server.",
                  "The network address of the server to which the request will be sent" SL_CLI_UNIT_SEPARATOR "The local endpoint from which the request will be sent" SL_CLI_UNIT_SEPARATOR "The remote endpoint to which the request will be sent" SL_CLI_UNIT_SEPARATOR "The sample ID as received in a previous startSamplingResponse" SL_CLI_UNIT_SEPARATOR "The earliest start time sampling" SL_CLI_UNIT_SEPARATOR "An 8-bit enumeration that identifies the required type of sampled data" SL_CLI_UNIT_SEPARATOR "The total number of samples" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT32, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_simple_hyphen_metering_hyphen_client_local_hyphen_change_hyphen_supply = \
  SL_CLI_COMMAND(sli_zigbee_af_simple_metering_client_cli_local_change_supply,
                 "Sends a start sampling command to a metering server.",
                  "The network address of the server to which the request will be sent" SL_CLI_UNIT_SEPARATOR "The local endpoint from which the request will be sent" SL_CLI_UNIT_SEPARATOR "The remote endpoint to which the request will be sent" SL_CLI_UNIT_SEPARATOR "" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_stack_hyphen_diagnostics_info = \
  SL_CLI_COMMAND(printInfo,
                 "Prints out general information about the state of the stack.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_stack_hyphen_diagnostics_child_hyphen_table = \
  SL_CLI_COMMAND(printChildTable,
                 "Prints out the entries in the stacks child table.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_stack_hyphen_diagnostics_neighbor_hyphen_table = \
  SL_CLI_COMMAND(printNeighborTable,
                 "Prints out the entries in the stacks neighbor table.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_stack_hyphen_diagnostics_route_hyphen_table = \
  SL_CLI_COMMAND(printRouteTable,
                 "Prints out the entries in the stacks route table.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_test_hyphen_harness_status = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessStatusCommand,
                 "Displays the current status of the test harness.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_aps_hyphen_sec_hyphen_for_hyphen_cluster_on = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessSetApsSecurityForClusterCommand,
                 "Turns on automatic APS security for the specified cluster.",
                  "The cluster ID to add APS security to automatically" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_aps_hyphen_sec_hyphen_for_hyphen_cluster_off = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessSetApsSecurityForClusterCommand,
                 "Turns off automatic APS security for the previously specified cluster.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_attr_options = \
  SL_CLI_COMMAND(setOptionsCommand,
                 "Sets the options for the attributes tests.",
                  "" SL_CLI_UNIT_SEPARATOR "" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_attr_set_hyphen_dest = \
  SL_CLI_COMMAND(setDestinationCommand,
                 "Sets the destination for the attributes tests.",
                  "" SL_CLI_UNIT_SEPARATOR "" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_attr_start_hyphen_test = \
  SL_CLI_COMMAND(startTestCommand,
                 "Starts the attributes test.",
                  "" SL_CLI_UNIT_SEPARATOR "" SL_CLI_UNIT_SEPARATOR "" SL_CLI_UNIT_SEPARATOR "" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT16, SL_CLI_ARG_INT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_registration_on = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessSetRegistrationCommand,
                 "Turns on automatic SE registration.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_registration_off = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessSetRegistrationCommand,
                 "Turns off automatic SE registration.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_key_hyphen_establishment_normal_hyphen_mode = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessKeyEstablishmentSetModeCommand,
                 "Sets the key establishment mode to normal.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_key_hyphen_establishment_no_hyphen_resources = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessKeyEstablishmentSetModeCommand,
                 "All received KE requests will be responded with no resources.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_key_hyphen_establishment_out_hyphen_of_hyphen_sequence = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessKeyEstablishmentSetModeCommand,
                 "Sends an out-of-sequence message.",
                  "The out-of-sequence command ID to send" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_key_hyphen_establishment_timeout = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessKeyEstablishmentSetModeCommand,
                 "Artificially creates a timeout by delaying an outgoing message.",
                  "",
                 {SL_CLI_ARG_END, });

