thanhnt2410/IOTChallenge2024_Smart_Parking_Car/Code EFR32XG24/Z3Gateway/autogen/sl_cli_command_table.c
static const sl_cli_command_info_t cli_cmd_key_hyphen_establishment_delay_hyphen_cbke = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessKeyEstablishmentSetModeCommand,
                 "Changes the advertised delays by the local device for CBKE.",
                  "Set the actual delay that occurs" SL_CLI_UNIT_SEPARATOR "Sets the advertised delay sent to the partner of key establishment" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_key_hyphen_establishment_default_hyphen_resp = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessKeyEstablishmentSetModeCommand,
                 "Sends a default response error message in response to initiate KE.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_key_hyphen_establishment_new_hyphen_key_hyphen_policy = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessKeyEstablishmentSetModeCommand,
                 "Sets the policy of whether the TC allows new KE requests.",
                  "Allows / disallows new key establishment requests" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_key_hyphen_establishment_reset_hyphen_aps_hyphen_fc = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessKeyEstablishmentSetModeCommand,
                 "Forces the local device to reset its outgoing APS FC.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_key_hyphen_establishment_adv_hyphen_aps_hyphen_fc = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessKeyEstablishmentSetModeCommand,
                 "Advances the local devices outgoing APS FC by 4096.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_cert_hyphen_mangle_length = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessCertMangleCommand,
                 "Mangles the length of the certificate.",
                  "The positive or negative change in length" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_INT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_cert_hyphen_mangle_issuer = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessCertMangleCommand,
                 "Changes the issuer in the certificate.",
                  "The EUI64 of the issuer (big endian)" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_HEX, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_cert_hyphen_mangle_corrupt = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessCertMangleCommand,
                 "Corrupts a single byte in the cert.",
                  "The index of the certificate byte to corrupt" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_cert_hyphen_mangle_change_hyphen_byte = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessCertMangleCommand,
                 "Changes a single byte in the cert.",
                  "The index of the certificate byte to change" SL_CLI_UNIT_SEPARATOR "The new value of the certificate byte" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_cert_hyphen_mangle_subject = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessCertMangleCommand,
                 "Changes the subject (EUI64) of the cert.",
                  "The EUI64 of the subject (big endian)" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_HEX, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_key_hyphen_establishment_suite = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessKeyEstablishmentSelectSuiteCommand,
                 "Selects between the CBKE 163k1 and 283k1 suites.",
                  "Holds the type        of key establishment suite. It can be EMBER_AF_CBKE_KEY_ESTABLISHMENT_SUITE_163K1,        EMBER_AF_CBKE_KEY_ESTABLISHMENT_SUITE_283K1, or        EMBER_AF_INVALID_KEY_ESTABLISHMENT_SUITE" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_key_hyphen_establishment_set_hyphen_available_hyphen_suite = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessKeyEstablishmentSetAvailableSuiteCommand,
                 "Selects between the CBKE 163k1 and 283k1 suites.",
                  "Holds the type        of key establishment suite. It can be EMBER_AF_CBKE_KEY_ESTABLISHMENT_SUITE_163K1,        EMBER_AF_CBKE_KEY_ESTABLISHMENT_SUITE_283K1, or        EMBER_AF_INVALID_KEY_ESTABLISHMENT_SUITE" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_key_hyphen_establishment_key_hyphen_mangle = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessKeyEstablishmentKeyMangleCommand,
                 "Mangles the length of the ephemeral key.",
                  "The positive or negative change in length" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_INT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_price_send_hyphen_new_hyphen_fields = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessPriceSendNewFieldsCommand,
                 "Controls whether the new SE 1.1 price fields are included.",
                  "Boolean indicating whether to send new fields" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_price_send_hyphen_se10_hyphen_fields = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessPriceSendNewFieldsCommand,
                 "Controls whether the new SE 1.1 price fields are included.",
                  "Boolean indicating whether to send new fields" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_tc_hyphen_keepalive_send = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessTcKeepaliveSendCommand,
                 "Sends a Trust Center Keepalive.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_tc_hyphen_keepalive_start = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessTcKeepaliveStartStopCommand,
                 "Starts the TC keepalive state machine.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_tc_hyphen_keepalive_stop = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessTcKeepaliveStartStopCommand,
                 "Stops the TC keepalive state machine.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_ota_image_hyphen_mangle = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessOtaImageMangleCommand,
                 "Mangles the Simple Storage RAM OTA image.",
                  "The byte index into the OTA image that will be mangled" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_test_hyphen_harness_concentrator_hyphen_start = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessConcentratorStartStopCommand,
                 "Starts the concentrators periodic broadcasts",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_test_hyphen_harness_concentrator_hyphen_stop = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessConcentratorStartStopCommand,
                 "Stops the concentrators periodic broadcasts",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_key_hyphen_update_unicast = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessKeyUpdateCommand,
                 "Changes TC NWK key update mechanism to unicast",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_key_hyphen_update_broadcast = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessKeyUpdateCommand,
                 "Changes TC NWK key update mechanism to broadcast.",
                  "",
                 {SL_CLI_ARG_END, });

