thanhnt2410/IOTChallenge2024_Smart_Parking_Car/Code EFR32XG24/Z3Gateway/autogen/sl_cli_command_table.c
static const sl_cli_command_info_t cli_cmd_key_hyphen_update_now = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessKeyUpdateCommand,
                 "Starts a TC NWK key update now.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_limit_hyphen_beacons_on = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessLimitBeaconsOnOffCommand,
                 "Enables a limit to the max number of outgoing beacons.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_limit_hyphen_beacons_off = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessLimitBeaconsOnOffCommand,
                 "Disables a limit to the max number of outgoing beacons.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_endpoint_enable = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessEnableDisableEndpointCommand,
                 "Enables the endpoint to receive messages and be discovered.",
                  "The endpoint number" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_endpoint_disable = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessEnableDisableEndpointCommand,
                 "Disables the endpoint to receive messages and be discovered.",
                  "The endpoint number" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_endpoint_status = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessEndpointStatusCommand,
                 "Disables the endpoint to receive messages and be discovered.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_endpoint_cluster_hyphen_endpoint_hyphen_index = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessClusterEndpointIndexCommand,
                 "Gets the cluster endpoint index.",
                  "The local endpoint of the cluster" SL_CLI_UNIT_SEPARATOR "The cluster whose index is needed" SL_CLI_UNIT_SEPARATOR "0 for client-side attributes or 1 for server-side attributes" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_radio_on = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessRadioOnOffCommand,
                 "Turns on the radio if it was previously turned off.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_radio_off = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessRadioOnOffCommand,
                 "Turns off the radio so that no messages are sent.",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_test_hyphen_harness_set_hyphen_radio_hyphen_power = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessSetRadioPower,
                 "Sets the radio power.",
                  "The radio power to set" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_test_hyphen_harness_add_hyphen_child = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessAddChildCommand,
                 "Adds a child to the child table.",
                  "The shortId of the child device" SL_CLI_UNIT_SEPARATOR "The EUI64 of the child (big endian)" SL_CLI_UNIT_SEPARATOR "The node type of the child device" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_HEX, SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_test_hyphen_harness_set_hyphen_compliance_hyphen_revision = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessSetNodeDescriptorComplianceRevision,
                 "Sets a compliance revision for a device such that the device can act as pre-R21 or R21+ for testing purposes. The reason for doing this is because the end device may send a node descriptor request and the hub will respond with the node descriptor response, which will include the hubs compliance revision. If the compliance revision of the hub is R21+, only then will the TC link key request be made by the end device.",
                  "The compliance version" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_test_hyphen_harness_set_hyphen_max_hyphen_children = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessSetMaxChildren,
                 "Sets the maximum children supported by the local node.",
                  "The maximum number of children to support" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_test_hyphen_harness_set_hyphen_neighbor_hyphen_table_hyphen_size = \
  SL_CLI_COMMAND(emberAfPluginTestHarnessSetNeighborTableSize,
                 "Sets the neighbor table size.",
                  "The size of the neighbor table" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_suppress_cluster = \
  SL_CLI_COMMAND(sl_zigbee_suppress_cluster,
                 "Suppress all automatic responses from specified cluster",
                  "cluster id value" SL_CLI_UNIT_SEPARATOR "server or client" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_suppress_command = \
  SL_CLI_COMMAND(sl_zigbee_suppress_command,
                 "Suppress all automatic responses from specified cluster command.",
                  "cluster id value" SL_CLI_UNIT_SEPARATOR "server or client" SL_CLI_UNIT_SEPARATOR "command id" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT16, SL_CLI_ARG_UINT8, SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_suppress_print = \
  SL_CLI_COMMAND(sl_zigbee_print_suppression_table,
                 "Print the cluster/command suppression table",
                  "",
                 {SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_update_hyphen_tc_hyphen_link_hyphen_key_timer = \
  SL_CLI_COMMAND(emberAfPluginSetTCLinkKeyUpdateTimerCommand,
                 "This sets the the amount of time between subsequent trust center link key updates in milliseconds.",
                  "The amount of time between subsequent trust center link key updates in milliseconds" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT32, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_network_form = \
  SL_CLI_COMMAND(networkFormCommand,
                 "Forms a network on a given channel, with a given TX Power and PAN ID.",
                  "The channel on which to form the network" SL_CLI_UNIT_SEPARATOR "One-byte signed value indicating the TX Power that the radio should be set to" SL_CLI_UNIT_SEPARATOR "The PAN ID on which to form the network" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_INT8, SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_network_join = \
  SL_CLI_COMMAND(networkJoinCommand,
                 "Joins a network on a given channel, with a given TX Power and PAN ID.",
                  "The channel on which to join the network" SL_CLI_UNIT_SEPARATOR "One-byte signed value indicating the TX Power that the radio should be set to" SL_CLI_UNIT_SEPARATOR "The PAN ID on which to join the network" SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_INT8, SL_CLI_ARG_UINT16, SL_CLI_ARG_END, });

static const sl_cli_command_info_t cli_cmd_network_pjoin = \
  SL_CLI_COMMAND(networkPermitJoinCommand,
                 "Turns permit joining on for the amount of time indicated.",
                  "A single byte indicating how long the device should have permit joining turn on for. A value of 0xff turns permit join indefinitely." SL_CLI_UNIT_SEPARATOR,
                 {SL_CLI_ARG_UINT8, SL_CLI_ARG_END, });

