thanhnt2410/IOTChallenge2024_Smart_Parking_Car/Code EFR32XG24/Z3Gateway/autogen/sl_cli_command_table.c
static const sl_cli_command_entry_t enable_type_group_table[] = {
  { "stack", &cli_cmd_enable_type_stack, false },
  { "core", &cli_cmd_enable_type_core, false },
  { "app", &cli_cmd_enable_type_app, false },
  { "zcl", &cli_cmd_enable_type_zcl, false },
  { "legacy_af_debug", &cli_cmd_enable_type_legacy_af_debug, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_enable_type = \
  SL_CLI_COMMAND_GROUP(enable_type_group_table, "");

static const sl_cli_command_entry_t zigbee_print_group_table[] = {
  { "enable_type", &cli_cmd_grp_enable_type, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_zigbee_print = \
  SL_CLI_COMMAND_GROUP(zigbee_print_group_table, "");

static const sl_cli_command_entry_t ezmode_hyphen_commissioning_group_table[] = {
  { "client", &cli_cmd_ezmode_hyphen_commissioning_client, false },
  { "server", &cli_cmd_ezmode_hyphen_commissioning_server, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_ezmode_hyphen_commissioning = \
  SL_CLI_COMMAND_GROUP(ezmode_hyphen_commissioning_group_table, "ezmode-commissioning related commands.");

static const sl_cli_command_entry_t gateway_group_table[] = {
  { "time-sync-local", &cli_cmd_gateway_time_hyphen_sync_hyphen_local, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_gateway = \
  SL_CLI_COMMAND_GROUP(gateway_group_table, "gateway related commands");

static const sl_cli_command_entry_t ias_hyphen_zone_hyphen_client_group_table[] = {
  { "print-servers", &cli_cmd_ias_hyphen_zone_hyphen_client_print_hyphen_servers, false },
  { "clear-all", &cli_cmd_ias_hyphen_zone_hyphen_client_clear_hyphen_all, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_ias_hyphen_zone_hyphen_client = \
  SL_CLI_COMMAND_GROUP(ias_hyphen_zone_hyphen_client_group_table, "ias-zone-client related commands.");

static const sl_cli_command_entry_t identify_group_table[] = {
  { "print", &cli_cmd_identify_print, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_identify = \
  SL_CLI_COMMAND_GROUP(identify_group_table, "identify related commands");

static const sl_cli_command_entry_t tone_group_table[] = {
  { "start", &cli_cmd_tone_start, false },
  { "stop", &cli_cmd_tone_stop, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_tone = \
  SL_CLI_COMMAND_GROUP(tone_group_table, "tone related commands");

static const sl_cli_command_entry_t stream_group_table[] = {
  { "start", &cli_cmd_stream_start, false },
  { "stop", &cli_cmd_stream_stop, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_stream = \
  SL_CLI_COMMAND_GROUP(stream_group_table, "stream related commands");

static const sl_cli_command_entry_t send_group_table[] = {
  { "random", &cli_cmd_send_random, false },
  { "test", &cli_cmd_send_test, false },
  { "message", &cli_cmd_send_message, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_send = \
  SL_CLI_COMMAND_GROUP(send_group_table, "send related commands");

static const sl_cli_command_entry_t mfglib_group_table[] = {
  { "start", &cli_cmd_mfglib_start, false },
  { "stop", &cli_cmd_mfglib_stop, false },
  { "status", &cli_cmd_mfglib_status, false },
  { "set-channel", &cli_cmd_mfglib_set_hyphen_channel, false },
  { "set-power", &cli_cmd_mfglib_set_hyphen_power, false },
  { "sleep", &cli_cmd_mfglib_sleep, false },
  { "programEui", &cli_cmd_mfglib_programEui, false },
  { "mfgenable", &cli_cmd_mfglib_mfgenable, false },
  { "set-options", &cli_cmd_mfglib_set_hyphen_options, false },
  { "tone", &cli_cmd_grp_tone, false },
  { "stream", &cli_cmd_grp_stream, false },
  { "send", &cli_cmd_grp_send, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_mfglib = \
  SL_CLI_COMMAND_GROUP(mfglib_group_table, "mfglib related commands");

static const sl_cli_command_entry_t mask_group_table[] = {
  { "add", &cli_cmd_mask_add, false },
  { "subtract", &cli_cmd_mask_subtract, false },
  { "set", &cli_cmd_mask_set, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_mask = \
  SL_CLI_COMMAND_GROUP(mask_group_table, "mask related commands");

static const sl_cli_command_entry_t network_hyphen_creator_group_table[] = {
  { "start", &cli_cmd_network_hyphen_creator_start, false },
  { "stop", &cli_cmd_network_hyphen_creator_stop, false },
  { "form", &cli_cmd_network_hyphen_creator_form, false },
  { "status", &cli_cmd_network_hyphen_creator_status, false },
  { "mask", &cli_cmd_grp_mask, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_network_hyphen_creator = \
  SL_CLI_COMMAND_GROUP(network_hyphen_creator_group_table, "network-creator related commands.");

static const sl_cli_command_entry_t network_hyphen_creator_hyphen_security_group_table[] = {
  { "set-joining-link-key", &cli_cmd_network_hyphen_creator_hyphen_security_set_hyphen_joining_hyphen_link_hyphen_key, false },
  { "clear-joining-link-keys", &cli_cmd_network_hyphen_creator_hyphen_security_clear_hyphen_joining_hyphen_link_hyphen_keys, false },
  { "open-network", &cli_cmd_network_hyphen_creator_hyphen_security_open_hyphen_network, false },
  { "close-network", &cli_cmd_network_hyphen_creator_hyphen_security_close_hyphen_network, false },
  { "open-with-key", &cli_cmd_network_hyphen_creator_hyphen_security_open_hyphen_with_hyphen_key, false },
  { "set-distributed-key", &cli_cmd_network_hyphen_creator_hyphen_security_set_hyphen_distributed_hyphen_key, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_network_hyphen_creator_hyphen_security = \
  SL_CLI_COMMAND_GROUP(network_hyphen_creator_hyphen_security_group_table, "network-creator-security related commands.");

static const sl_cli_command_entry_t shell_mask_1_group_table[] = {
  { "set", &cli_cmd_shell_mask_1_set, false },
  { "add", &cli_cmd_shell_mask_1_add, false },
  { "subtract", &cli_cmd_shell_mask_1_subtract, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_shell_mask_1 = \
  SL_CLI_COMMAND_GROUP(shell_mask_1_group_table, "mask related command.");

