thanhnt2410/IOTChallenge2024_Smart_Parking_Car/Code EFR32XG24/Z3Gateway/autogen/sl_cli_command_table.c
static const sl_cli_command_entry_t network_hyphen_steering_group_table[] = {
  { "status", &cli_cmd_network_hyphen_steering_status, false },
  { "start", &cli_cmd_network_hyphen_steering_start, false },
  { "stop", &cli_cmd_network_hyphen_steering_stop, false },
  { "pre-configured-key-set", &cli_cmd_network_hyphen_steering_pre_hyphen_configured_hyphen_key_hyphen_set, false },
  { "mask", &cli_cmd_grp_shell_mask_1, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_network_hyphen_steering = \
  SL_CLI_COMMAND_GROUP(network_hyphen_steering_group_table, "network-steering related commands.");

static const sl_cli_command_entry_t policy_group_table[] = {
  { "print", &cli_cmd_policy_print, false },
  { "query", &cli_cmd_policy_query, false },
  { "upgrade", &cli_cmd_policy_upgrade, false },
  { "page-req-miss", &cli_cmd_policy_page_hyphen_req_hyphen_miss, false },
  { "page-req-sup", &cli_cmd_policy_page_hyphen_req_hyphen_sup, false },
  { "block-request", &cli_cmd_policy_block_hyphen_request, false },
  { "image-req-min-period", &cli_cmd_policy_image_hyphen_req_hyphen_min_hyphen_period, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_policy = \
  SL_CLI_COMMAND_GROUP(policy_group_table, "policy related commands");

static const sl_cli_command_entry_t ota_hyphen_server_group_table[] = {
  { "notify", &cli_cmd_ota_hyphen_server_notify, false },
  { "upgrade", &cli_cmd_ota_hyphen_server_upgrade, false },
  { "policy", &cli_cmd_grp_policy, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_ota_hyphen_server = \
  SL_CLI_COMMAND_GROUP(ota_hyphen_server_group_table, "ota-server related commands.");

static const sl_cli_command_entry_t ota_hyphen_storage_hyphen_common_group_table[] = {
  { "printImages", &cli_cmd_ota_hyphen_storage_hyphen_common_printImages, false },
  { "delete", &cli_cmd_ota_hyphen_storage_hyphen_common_delete, false },
  { "reload", &cli_cmd_ota_hyphen_storage_hyphen_common_reload, false },
  { "storage-info", &cli_cmd_ota_hyphen_storage_hyphen_common_storage_hyphen_info, false },
  { "data-print", &cli_cmd_ota_hyphen_storage_hyphen_common_data_hyphen_print, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_ota_hyphen_storage_hyphen_common = \
  SL_CLI_COMMAND_GROUP(ota_hyphen_storage_hyphen_common_group_table, "ota-storage-common related commands");

static const sl_cli_command_entry_t poll_hyphen_control_hyphen_client_group_table[] = {
  { "mode", &cli_cmd_poll_hyphen_control_hyphen_client_mode, false },
  { "timeout", &cli_cmd_poll_hyphen_control_hyphen_client_timeout, false },
  { "respond", &cli_cmd_poll_hyphen_control_hyphen_client_respond, false },
  { "print", &cli_cmd_poll_hyphen_control_hyphen_client_print, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_poll_hyphen_control_hyphen_client = \
  SL_CLI_COMMAND_GROUP(poll_hyphen_control_hyphen_client_group_table, "poll-control-client related commands.");

static const sl_cli_command_entry_t reporting_group_table[] = {
  { "print", &cli_cmd_reporting_print, false },
  { "clear", &cli_cmd_reporting_clear, false },
  { "remove", &cli_cmd_reporting_remove, false },
  { "add", &cli_cmd_reporting_add, false },
  { "clear-last-report-time", &cli_cmd_reporting_clear_hyphen_last_hyphen_report_hyphen_time, false },
  { "test-timing", &cli_cmd_reporting_test_hyphen_timing, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_reporting = \
  SL_CLI_COMMAND_GROUP(reporting_group_table, "reporting related commands.");

static const sl_cli_command_entry_t simple_hyphen_metering_hyphen_client_group_table[] = {
  { "sch-snapshot", &cli_cmd_simple_hyphen_metering_hyphen_client_sch_hyphen_snapshot, false },
  { "start-sampling", &cli_cmd_simple_hyphen_metering_hyphen_client_start_hyphen_sampling, false },
  { "get-sampled-data", &cli_cmd_simple_hyphen_metering_hyphen_client_get_hyphen_sampled_hyphen_data, false },
  { "local-change-supply", &cli_cmd_simple_hyphen_metering_hyphen_client_local_hyphen_change_hyphen_supply, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_simple_hyphen_metering_hyphen_client = \
  SL_CLI_COMMAND_GROUP(simple_hyphen_metering_hyphen_client_group_table, "simple-metering-client related commands.");

static const sl_cli_command_entry_t stack_hyphen_diagnostics_group_table[] = {
  { "info", &cli_cmd_stack_hyphen_diagnostics_info, false },
  { "child-table", &cli_cmd_stack_hyphen_diagnostics_child_hyphen_table, false },
  { "neighbor-table", &cli_cmd_stack_hyphen_diagnostics_neighbor_hyphen_table, false },
  { "route-table", &cli_cmd_stack_hyphen_diagnostics_route_hyphen_table, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_stack_hyphen_diagnostics = \
  SL_CLI_COMMAND_GROUP(stack_hyphen_diagnostics_group_table, "stack-diagnostics related commands.");

static const sl_cli_command_entry_t aps_hyphen_sec_hyphen_for_hyphen_cluster_group_table[] = {
  { "on", &cli_cmd_aps_hyphen_sec_hyphen_for_hyphen_cluster_on, false },
  { "off", &cli_cmd_aps_hyphen_sec_hyphen_for_hyphen_cluster_off, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_aps_hyphen_sec_hyphen_for_hyphen_cluster = \
  SL_CLI_COMMAND_GROUP(aps_hyphen_sec_hyphen_for_hyphen_cluster_group_table, "aps-sec-for-cluster related commands.");

static const sl_cli_command_entry_t attr_group_table[] = {
  { "options", &cli_cmd_attr_options, false },
  { "set-dest", &cli_cmd_attr_set_hyphen_dest, false },
  { "start-test", &cli_cmd_attr_start_hyphen_test, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_attr = \
  SL_CLI_COMMAND_GROUP(attr_group_table, "attr related commands.");

static const sl_cli_command_entry_t registration_group_table[] = {
  { "on", &cli_cmd_registration_on, false },
  { "off", &cli_cmd_registration_off, false },
  { NULL, NULL, false },
};
