thanhnt2410/IOTChallenge2024_Smart_Parking_Car/Code EFR32XG24/Z3Gateway/autogen/sl_cli_command_table.c
static const sl_cli_command_info_t cli_cmd_grp_registration = \
  SL_CLI_COMMAND_GROUP(registration_group_table, "registration related commands.");

static const sl_cli_command_entry_t cert_hyphen_mangle_group_table[] = {
  { "length", &cli_cmd_cert_hyphen_mangle_length, false },
  { "issuer", &cli_cmd_cert_hyphen_mangle_issuer, false },
  { "corrupt", &cli_cmd_cert_hyphen_mangle_corrupt, false },
  { "change-byte", &cli_cmd_cert_hyphen_mangle_change_hyphen_byte, false },
  { "subject", &cli_cmd_cert_hyphen_mangle_subject, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_cert_hyphen_mangle = \
  SL_CLI_COMMAND_GROUP(cert_hyphen_mangle_group_table, "cert-mangle related commands.");

static const sl_cli_command_entry_t key_hyphen_establishment_group_table[] = {
  { "normal-mode", &cli_cmd_key_hyphen_establishment_normal_hyphen_mode, false },
  { "no-resources", &cli_cmd_key_hyphen_establishment_no_hyphen_resources, false },
  { "out-of-sequence", &cli_cmd_key_hyphen_establishment_out_hyphen_of_hyphen_sequence, false },
  { "timeout", &cli_cmd_key_hyphen_establishment_timeout, false },
  { "delay-cbke", &cli_cmd_key_hyphen_establishment_delay_hyphen_cbke, false },
  { "default-resp", &cli_cmd_key_hyphen_establishment_default_hyphen_resp, false },
  { "new-key-policy", &cli_cmd_key_hyphen_establishment_new_hyphen_key_hyphen_policy, false },
  { "reset-aps-fc", &cli_cmd_key_hyphen_establishment_reset_hyphen_aps_hyphen_fc, false },
  { "adv-aps-fc", &cli_cmd_key_hyphen_establishment_adv_hyphen_aps_hyphen_fc, false },
  { "suite", &cli_cmd_key_hyphen_establishment_suite, false },
  { "set-available-suite", &cli_cmd_key_hyphen_establishment_set_hyphen_available_hyphen_suite, false },
  { "key-mangle", &cli_cmd_key_hyphen_establishment_key_hyphen_mangle, false },
  { "cert-mangle", &cli_cmd_grp_cert_hyphen_mangle, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_key_hyphen_establishment = \
  SL_CLI_COMMAND_GROUP(key_hyphen_establishment_group_table, "key-establishment related commands.");

static const sl_cli_command_entry_t price_group_table[] = {
  { "send-new-fields", &cli_cmd_price_send_hyphen_new_hyphen_fields, false },
  { "send-se10-fields", &cli_cmd_price_send_hyphen_se10_hyphen_fields, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_price = \
  SL_CLI_COMMAND_GROUP(price_group_table, "price related commands.");

static const sl_cli_command_entry_t tc_hyphen_keepalive_group_table[] = {
  { "send", &cli_cmd_tc_hyphen_keepalive_send, false },
  { "start", &cli_cmd_tc_hyphen_keepalive_start, false },
  { "stop", &cli_cmd_tc_hyphen_keepalive_stop, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_tc_hyphen_keepalive = \
  SL_CLI_COMMAND_GROUP(tc_hyphen_keepalive_group_table, "tc-keepalive related commands.");

static const sl_cli_command_entry_t ota_group_table[] = {
  { "image-mangle", &cli_cmd_ota_image_hyphen_mangle, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_ota = \
  SL_CLI_COMMAND_GROUP(ota_group_table, "ota related commands.");

static const sl_cli_command_entry_t key_hyphen_update_group_table[] = {
  { "unicast", &cli_cmd_key_hyphen_update_unicast, false },
  { "broadcast", &cli_cmd_key_hyphen_update_broadcast, false },
  { "now", &cli_cmd_key_hyphen_update_now, false },
  { "security", &cli_cmd_grp_security, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_key_hyphen_update = \
  SL_CLI_COMMAND_GROUP(key_hyphen_update_group_table, "key-update related commands.");

static const sl_cli_command_entry_t limit_hyphen_beacons_group_table[] = {
  { "on", &cli_cmd_limit_hyphen_beacons_on, false },
  { "off", &cli_cmd_limit_hyphen_beacons_off, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_limit_hyphen_beacons = \
  SL_CLI_COMMAND_GROUP(limit_hyphen_beacons_group_table, "limit-beacons related commands.");

static const sl_cli_command_entry_t stack_group_table[] = {
  { "limit-beacons", &cli_cmd_grp_limit_hyphen_beacons, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_stack = \
  SL_CLI_COMMAND_GROUP(stack_group_table, "stack related commands.");

static const sl_cli_command_entry_t channel_hyphen_mask_group_table[] = {
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_channel_hyphen_mask = \
  SL_CLI_COMMAND_GROUP(channel_hyphen_mask_group_table, "channel-mask related commands");

static const sl_cli_command_entry_t endpoint_group_table[] = {
  { "enable", &cli_cmd_endpoint_enable, false },
  { "disable", &cli_cmd_endpoint_disable, false },
  { "status", &cli_cmd_endpoint_status, false },
  { "cluster-endpoint-index", &cli_cmd_endpoint_cluster_hyphen_endpoint_hyphen_index, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_endpoint = \
  SL_CLI_COMMAND_GROUP(endpoint_group_table, "endpoint related commands.");

static const sl_cli_command_entry_t radio_group_table[] = {
  { "on", &cli_cmd_radio_on, false },
  { "off", &cli_cmd_radio_off, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_radio = \
  SL_CLI_COMMAND_GROUP(radio_group_table, "radio related commands.");

static const sl_cli_command_entry_t test_hyphen_harness_group_table[] = {
  { "status", &cli_cmd_test_hyphen_harness_status, false },
  { "concentrator-start", &cli_cmd_test_hyphen_harness_concentrator_hyphen_start, false },
  { "concentrator-stop", &cli_cmd_test_hyphen_harness_concentrator_hyphen_stop, false },
  { "set-radio-power", &cli_cmd_test_hyphen_harness_set_hyphen_radio_hyphen_power, false },
  { "add-child", &cli_cmd_test_hyphen_harness_add_hyphen_child, false },
  { "set-compliance-revision", &cli_cmd_test_hyphen_harness_set_hyphen_compliance_hyphen_revision, false },
  { "set-max-children", &cli_cmd_test_hyphen_harness_set_hyphen_max_hyphen_children, false },
  { "set-neighbor-table-size", &cli_cmd_test_hyphen_harness_set_hyphen_neighbor_hyphen_table_hyphen_size, false },
  { "aps-sec-for-cluster", &cli_cmd_grp_aps_hyphen_sec_hyphen_for_hyphen_cluster, false },
  { "attr", &cli_cmd_grp_attr, false },
  { "registration", &cli_cmd_grp_registration, false },
  { "key-establishment", &cli_cmd_grp_key_hyphen_establishment, false },
  { "price", &cli_cmd_grp_price, false },
  { "tc-keepalive", &cli_cmd_grp_tc_hyphen_keepalive, false },
  { "ota", &cli_cmd_grp_ota, false },
  { "key-update", &cli_cmd_grp_key_hyphen_update, false },
  { "stack", &cli_cmd_grp_stack, false },
  { "channel-mask", &cli_cmd_grp_channel_hyphen_mask, false },
  { "endpoint", &cli_cmd_grp_endpoint, false },
  { "radio", &cli_cmd_grp_radio, false },
  { NULL, NULL, false },
};
static const sl_cli_command_info_t cli_cmd_grp_test_hyphen_harness = \
  SL_CLI_COMMAND_GROUP(test_hyphen_harness_group_table, "test-harness related commands.");

